//Выполнил: Артем Анатольевич Авдеев
//___________________________________________________________________________________________________________________________________
// Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых
// меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте
// выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись
// исключительно массивами.
//===================================================================================================================================
//Решение:
//-----------------------------------------------------------------------------------------------------------------------------------
int GetDgtStng(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
    System.Console.Write(txt);  //вывод комментария на консоль
    return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
string[] StringArrayConsoleInput(int sizeArray)    //метод создания массива строк заданного размера, с водом значений строк с консоли
{
    var consoleStringArray = new string[sizeArray];   //создание массива заданной длины

    for (int i = 0; i < consoleStringArray.Length; i++)
    {
        System.Console.Write("Введите значение строки №" + (i + 1) + ": ");  //вывод комментария на консоль
        consoleStringArray[i] = System.Console.ReadLine();
    }
    return consoleStringArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
int CounterByCondition(string[] inputArray)    //метод, возращающий количество условий, соответсвующих заданию (кол-во символов <=3)
{
    int indexSymbol = 0;
    for (int j = 0; j < inputArray.Length; j++)
    {
        if (inputArray[j].Length <= 3) { indexSymbol++; }
    }
    return indexSymbol;
}
//-----------------------------------------------------------------------------------------------------------------------------------
string[] ResultArray(string[] sourceArray, int lengthArray) //метод возращающий массив с выбранными по условию строками
{
    var finalArray = new string[lengthArray];   //создание массива заданной длины
    int n = 0;
    for (int m = 0; m < sourceArray.Length; m++)
    {
        if (sourceArray[m].Length <= 3)
        {
            finalArray[n] = sourceArray[m];
            n++;
        }
    }
    return finalArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayStringArray(string[] printingArray) //метод, выводящий на консоль строки массива
{
    System.Console.WriteLine();
    System.Console.WriteLine("Массив из строк, длина которых меньше или равна трем символам:");
    System.Console.WriteLine();

    for (int q = 0; q < printingArray.Length; q++)
    {
        System.Console.WriteLine($"{printingArray[q]}");
    }
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()
{
    System.Console.WriteLine();
    var primeArray = StringArrayConsoleInput(GetDgtStng("Введите размер строчного массива: "));
    DisplayStringArray(ResultArray(primeArray, CounterByCondition(primeArray)));
    System.Console.WriteLine();
}
//-----------------------------------------------------------------------------------------------------------------------------------

DisplayAll();